; ModuleID = 'BitcodeBuffer'
source_filename = "test"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-unknown-unknown"

%Io.Writer.VTable = type { ptr, ptr, ptr, ptr }
%fmt.Options = type { { i64, i8, [7 x i8] }, { i64, i8, [7 x i8] }, i2, i8, [6 x i8] }
%builtin.Type.Int = type { i16, i1, [1 x i8] }
%Target.Cpu.Feature.Set = type { [5 x i64] }
%Target.Cpu = type { ptr, %Target.Cpu.Feature.Set, i6, [7 x i8] }
%Target.Cpu.Model = type { { ptr, i64 }, { ptr, i64 }, %Target.Cpu.Feature.Set }
%Target.DynamicLinker = type { [255 x i8], i8 }
%builtin.CallingConvention.CommonOptions = type { { i64, i8, [7 x i8] } }
%std.Options = type { { i64, i8, [7 x i8] }, { i64, i8, [7 x i8] }, i64, i1, i2, i1, i1, i1, i1, i1, i2 }
%ubsan_rt.Value = type { ptr, ptr }
%builtin.StackTrace = type { i64, { ptr, i64 } }
%ubsan_rt.OverflowData = type { %ubsan_rt.SourceLocation, ptr }
%ubsan_rt.SourceLocation = type { ptr, i32, i32 }
%ubsan_rt.TypeDescriptor = type { i16, %ubsan_rt.TypeDescriptor.Info }
%ubsan_rt.TypeDescriptor.Info = type { i16 }
%Io.Writer = type { ptr, { ptr, i64 }, i64 }
%ubsan_rt.AlignmentAssumptionData = type { %ubsan_rt.SourceLocation, %ubsan_rt.SourceLocation, ptr }
%ubsan_rt.FloatCastOverflowData = type { ptr, ptr }
%ubsan_rt.FloatCastOverflowDataV2 = type { %ubsan_rt.SourceLocation, ptr, ptr }
%ubsan_rt.InvalidBuiltinData = type { %ubsan_rt.SourceLocation, i8, [7 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FLOAT128_POW5_INV_SPLIT", linkageName: "fmt.float.FLOAT128_POW5_INV_SPLIT", scope: !2, file: !2, line: 1380, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "float.zig", directory: "/usr/local/lib/zig/std/fmt")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 22784, align: 64, elements: !8)
!4 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, align: 64, elements: !6)
!5 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!6 = !{!7}
!7 = !DISubrange(count: 4, lowerBound: 0)
!8 = !{!9}
!9 = !DISubrange(count: 89, lowerBound: 0)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "FLOAT128_POW5_TABLE", linkageName: "fmt.float.FLOAT128_POW5_TABLE", scope: !2, file: !2, line: 1185, type: !12, isLocal: true, isDefinition: true)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 7168, align: 64, elements: !16)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, align: 64, elements: !14)
!14 = !{!15}
!15 = !DISubrange(count: 2, lowerBound: 0)
!16 = !{!17}
!17 = !DISubrange(count: 56, lowerBound: 0)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "FLOAT128_POW5_SPLIT", linkageName: "fmt.float.FLOAT128_POW5_SPLIT", scope: !2, file: !2, line: 1244, type: !3, isLocal: true, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "zig_backend", linkageName: "builtin.zig_backend", scope: !22, file: !22, line: 6, type: !23, isLocal: true, isDefinition: true)
!22 = !DIFile(filename: "builtin.zig", directory: "/home/alex/.cache/zig/b/155473c05170159f3c5ae3721caec00f")
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CompilerBackend", scope: !24, file: !24, line: 1027, baseType: !5, size: 64, align: 64, elements: !25)
!24 = !DIFile(filename: "builtin.zig", directory: "/usr/local/lib/zig/std")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!26 = !DIEnumerator(name: "other", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "stage1", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "stage2_llvm", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "stage2_c", value: 3, isUnsigned: true)
!30 = !DIEnumerator(name: "stage2_wasm", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "stage2_arm", value: 5, isUnsigned: true)
!32 = !DIEnumerator(name: "stage2_x86_64", value: 6, isUnsigned: true)
!33 = !DIEnumerator(name: "stage2_aarch64", value: 7, isUnsigned: true)
!34 = !DIEnumerator(name: "stage2_x86", value: 8, isUnsigned: true)
!35 = !DIEnumerator(name: "stage2_riscv64", value: 9, isUnsigned: true)
!36 = !DIEnumerator(name: "stage2_sparc64", value: 10, isUnsigned: true)
!37 = !DIEnumerator(name: "stage2_spirv", value: 11, isUnsigned: true)
!38 = !DIEnumerator(name: "stage2_powerpc", value: 12, isUnsigned: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "can_build_ubsan", linkageName: "ubsan_rt.can_build_ubsan", scope: !41, file: !41, line: 650, type: !42, isLocal: true, isDefinition: true)
!41 = !DIFile(filename: "ubsan_rt.zig", directory: "/usr/local/lib/zig")
!42 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "empty", linkageName: "Target.Cpu.Feature.Set.empty", scope: !45, file: !45, line: 1153, type: !46, isLocal: true, isDefinition: true)
!45 = !DIFile(filename: "Target.zig", directory: "/usr/local/lib/zig/std")
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Cpu.Feature.Set", scope: !47, size: 320, align: 64, elements: !766)
!47 = distinct !DICompileUnit(language: DW_LANG_C99, file: !48, producer: "zig 0.15.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, globals: !656, splitDebugInlining: false)
!48 = !DIFile(filename: "test", directory: "/home/alex/repos/code101/src/test")
!49 = !{!50, !65, !81, !102, !122, !127, !165, !170, !175, !179, !198, !202, !23, !206, !265, !303, !311, !380, !413, !427, !439, !454, !462, !632, !638, !645, !651}
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ubsan_rt.TypeDescriptor.Kind", scope: !51, file: !41, line: 17, baseType: !60, size: 16, align: 16, elements: !61)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.TypeDescriptor", scope: !47, size: 32, align: 16, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !51, baseType: !50, size: 16, align: 16)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !51, baseType: !55, size: 16, align: 16, offset: 16)
!55 = !DICompositeType(tag: DW_TAG_union_type, name: "ubsan_rt.TypeDescriptor.Info", scope: !47, size: 16, align: 16, elements: !56)
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !55, baseType: !58, size: 16, align: 16)
!58 = !DIBasicType(name: "ubsan_rt.TypeDescriptor.Info__struct_1685", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "float", scope: !55, baseType: !60, size: 16, align: 16)
!60 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "integer", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "float", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "unknown", value: 65535, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ubsan_rt.InvalidBuiltinData__enum_1923", scope: !66, file: !41, line: 546, baseType: !73, size: 8, align: 8, elements: !78)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.InvalidBuiltinData", scope: !47, size: 192, align: 64, elements: !67)
!67 = !{!68, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !66, baseType: !69, size: 128, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.SourceLocation", scope: !47, size: 128, align: 64, elements: !70)
!70 = !{!71, !74, !76}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "file_name", scope: !69, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !73, size: 64, align: 8)
!73 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !69, baseType: !75, size: 32, align: 32, offset: 64)
!75 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !69, baseType: !75, size: 32, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !66, baseType: !65, size: 8, align: 8, offset: 128)
!78 = !{!79, !80}
!79 = !DIEnumerator(name: "ctz", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "clz", value: 1, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ubsan_rt.TypeMismatchData__enum_2209", scope: !82, file: !41, line: 442, baseType: !73, size: 8, align: 8, elements: !89)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.TypeMismatchData", scope: !47, size: 256, align: 64, elements: !83)
!83 = !{!84, !85, !87, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !82, baseType: !69, size: 128, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !82, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*ubsan_rt.TypeDescriptor", baseType: !51, size: 64, align: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "log_alignment", scope: !82, baseType: !73, size: 8, align: 8, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !82, baseType: !81, size: 8, align: 8, offset: 200)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!90 = !DIEnumerator(name: "load", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "store", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "reference_binding", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "member_access", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "member_call", value: 4, isUnsigned: true)
!95 = !DIEnumerator(name: "constructor_call", value: 5, isUnsigned: true)
!96 = !DIEnumerator(name: "downcast_pointer", value: 6, isUnsigned: true)
!97 = !DIEnumerator(name: "downcast_reference", value: 7, isUnsigned: true)
!98 = !DIEnumerator(name: "upcast", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "upcast_to_virtual_base", value: 9, isUnsigned: true)
!100 = !DIEnumerator(name: "nonnull_assign", value: 10, isUnsigned: true)
!101 = !DIEnumerator(name: "dynamic_operation", value: 11, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "@typeInfo(fmt.Specifier).@\22union\22.tag_type.?", scope: !104, file: !103, line: 165, baseType: !117, size: 8, align: 8, elements: !118)
!103 = !DIFile(filename: "fmt.zig", directory: "/usr/local/lib/zig/std")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "fmt.Specifier", scope: !47, size: 192, align: 64, elements: !105)
!105 = !{!106, !116}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !104, baseType: !107, size: 128, align: 64)
!107 = !DICompositeType(tag: DW_TAG_union_type, name: "fmt.Specifier:Payload", scope: !47, size: 128, align: 64, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !107, baseType: !110, size: 64, align: 64)
!110 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !107, baseType: !112, size: 128, align: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]u8", scope: !47, size: 128, align: 64, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !112, baseType: !72, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !112, baseType: !110, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !104, baseType: !102, size: 8, align: 8, offset: 128)
!117 = !DIBasicType(name: "u2", size: 8, encoding: DW_ATE_unsigned)
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "number", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "named", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fmt.Alignment", scope: !103, file: !103, line: 21, baseType: !117, size: 8, align: 8, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "left", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "center", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "right", value: 2, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fs.File.Reader.Mode", scope: !129, file: !128, line: 1166, baseType: !158, size: 8, align: 8, elements: !159)
!128 = !DIFile(filename: "File.zig", directory: "/usr/local/lib/zig/std/fs")
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs.File.Reader", scope: !47, size: 576, align: 64, elements: !130)
!130 = !{!131, !132, !137, !153, !155, !156, !157}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !129, baseType: !5, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, baseType: !133, size: 128, align: 64, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "?u64", scope: !47, size: 128, align: 64, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, baseType: !5, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "some", scope: !133, baseType: !73, size: 8, align: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "interface", scope: !129, baseType: !138, size: 320, align: 64, offset: 192)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "Io.Reader", scope: !47, size: 320, align: 64, elements: !139)
!139 = !{!140, !150, !151, !152}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !138, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*Io.Reader.VTable", baseType: !142, size: 64, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Io.Reader.VTable", scope: !47, size: 256, align: 64, elements: !143)
!143 = !{!144, !147, !148, !149}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !142, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*anyopaque", baseType: !146, size: 64, align: 8)
!146 = !DIBasicType(name: "anyopaque", encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "discard", scope: !142, baseType: !145, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "readVec", scope: !142, baseType: !145, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rebase", scope: !142, baseType: !145, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !138, baseType: !112, size: 128, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !138, baseType: !110, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !138, baseType: !110, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !129, baseType: !154, size: 16, align: 16, offset: 512)
!154 = !DIBasicType(name: "anyerror", size: 16, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size_err", scope: !129, baseType: !154, size: 16, align: 16, offset: 528)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "seek_err", scope: !129, baseType: !154, size: 16, align: 16, offset: 544)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !129, baseType: !127, size: 8, align: 8, offset: 560)
!158 = !DIBasicType(name: "u3", size: 8, encoding: DW_ATE_unsigned)
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIEnumerator(name: "streaming", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "positional", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "streaming_reading", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "positional_reading", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "failure", value: 4, isUnsigned: true)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Io.Limit", scope: !166, file: !166, line: 79, baseType: !110, size: 64, align: 64, elements: !167)
!166 = !DIFile(filename: "Io.zig", directory: "/usr/local/lib/zig/std")
!167 = !{!168, !169}
!168 = !DIEnumerator(name: "nothing", value: 0, isUnsigned: true)
!169 = !DIEnumerator(name: "unlimited", value: 18446744073709551615, isUnsigned: true)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fmt.Case", scope: !103, file: !103, line: 27, baseType: !171, size: 8, align: 8, elements: !172)
!171 = !DIBasicType(name: "u1", size: 8, encoding: DW_ATE_unsigned)
!172 = !{!173, !174}
!173 = !DIEnumerator(name: "lower", value: 0, isUnsigned: true)
!174 = !DIEnumerator(name: "upper", value: 1, isUnsigned: true)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.Signedness", scope: !24, file: !24, line: 775, baseType: !171, size: 8, align: 8, elements: !176)
!176 = !{!177, !178}
!177 = !DIEnumerator(name: "signed", value: 0, isUnsigned: true)
!178 = !DIEnumerator(name: "unsigned", value: 1, isUnsigned: true)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fmt.Number.Mode", scope: !180, file: !103, line: 77, baseType: !158, size: 8, align: 8, elements: !192)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "fmt.Number", scope: !47, size: 320, align: 64, elements: !181)
!181 = !{!182, !187, !188, !189, !190, !191}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !180, baseType: !183, size: 128, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "?usize", scope: !47, size: 128, align: 64, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, baseType: !110, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "some", scope: !183, baseType: !73, size: 8, align: 8, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !180, baseType: !183, size: 128, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !180, baseType: !179, size: 8, align: 8, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "case", scope: !180, baseType: !170, size: 8, align: 8, offset: 264)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !180, baseType: !122, size: 8, align: 8, offset: 272)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !180, baseType: !73, size: 8, align: 8, offset: 280)
!192 = !{!193, !194, !195, !196, !197}
!193 = !DIEnumerator(name: "decimal", value: 0, isUnsigned: true)
!194 = !DIEnumerator(name: "binary", value: 1, isUnsigned: true)
!195 = !DIEnumerator(name: "octal", value: 2, isUnsigned: true)
!196 = !DIEnumerator(name: "hex", value: 3, isUnsigned: true)
!197 = !DIEnumerator(name: "scientific", value: 4, isUnsigned: true)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fmt.float.Mode", scope: !2, file: !2, line: 34, baseType: !171, size: 8, align: 8, elements: !199)
!199 = !{!200, !201}
!200 = !DIEnumerator(name: "scientific", value: 0, isUnsigned: true)
!201 = !DIEnumerator(name: "decimal", value: 1, isUnsigned: true)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fmt.float.RoundMode", scope: !2, file: !2, line: 130, baseType: !171, size: 8, align: 8, elements: !203)
!203 = !{!204, !205}
!204 = !DIEnumerator(name: "decimal", value: 0, isUnsigned: true)
!205 = !DIEnumerator(name: "scientific", value: 1, isUnsigned: true)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Cpu.Arch", scope: !207, file: !45, line: 1777, baseType: !218, size: 8, align: 8, elements: !219)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Cpu", scope: !47, size: 448, align: 64, elements: !208)
!208 = !{!209, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !207, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*Target.Cpu.Model", baseType: !211, size: 64, align: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Cpu.Model", scope: !47, size: 576, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, baseType: !112, size: 128, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "llvm_name", scope: !211, baseType: !112, size: 128, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !211, baseType: !46, size: 320, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !207, baseType: !46, size: 320, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !207, baseType: !206, size: 8, align: 8, offset: 384)
!218 = !DIBasicType(name: "u6", size: 8, encoding: DW_ATE_unsigned)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!220 = !DIEnumerator(name: "amdgcn", value: 0, isUnsigned: true)
!221 = !DIEnumerator(name: "arc", value: 1, isUnsigned: true)
!222 = !DIEnumerator(name: "arm", value: 2, isUnsigned: true)
!223 = !DIEnumerator(name: "armeb", value: 3, isUnsigned: true)
!224 = !DIEnumerator(name: "thumb", value: 4, isUnsigned: true)
!225 = !DIEnumerator(name: "thumbeb", value: 5, isUnsigned: true)
!226 = !DIEnumerator(name: "aarch64", value: 6, isUnsigned: true)
!227 = !DIEnumerator(name: "aarch64_be", value: 7, isUnsigned: true)
!228 = !DIEnumerator(name: "avr", value: 8, isUnsigned: true)
!229 = !DIEnumerator(name: "bpfel", value: 9, isUnsigned: true)
!230 = !DIEnumerator(name: "bpfeb", value: 10, isUnsigned: true)
!231 = !DIEnumerator(name: "csky", value: 11, isUnsigned: true)
!232 = !DIEnumerator(name: "hexagon", value: 12, isUnsigned: true)
!233 = !DIEnumerator(name: "kalimba", value: 13, isUnsigned: true)
!234 = !DIEnumerator(name: "lanai", value: 14, isUnsigned: true)
!235 = !DIEnumerator(name: "loongarch32", value: 15, isUnsigned: true)
!236 = !DIEnumerator(name: "loongarch64", value: 16, isUnsigned: true)
!237 = !DIEnumerator(name: "m68k", value: 17, isUnsigned: true)
!238 = !DIEnumerator(name: "mips", value: 18, isUnsigned: true)
!239 = !DIEnumerator(name: "mipsel", value: 19, isUnsigned: true)
!240 = !DIEnumerator(name: "mips64", value: 20, isUnsigned: true)
!241 = !DIEnumerator(name: "mips64el", value: 21, isUnsigned: true)
!242 = !DIEnumerator(name: "msp430", value: 22, isUnsigned: true)
!243 = !DIEnumerator(name: "or1k", value: 23, isUnsigned: true)
!244 = !DIEnumerator(name: "nvptx", value: 24, isUnsigned: true)
!245 = !DIEnumerator(name: "nvptx64", value: 25, isUnsigned: true)
!246 = !DIEnumerator(name: "powerpc", value: 26, isUnsigned: true)
!247 = !DIEnumerator(name: "powerpcle", value: 27, isUnsigned: true)
!248 = !DIEnumerator(name: "powerpc64", value: 28, isUnsigned: true)
!249 = !DIEnumerator(name: "powerpc64le", value: 29, isUnsigned: true)
!250 = !DIEnumerator(name: "propeller", value: 30, isUnsigned: true)
!251 = !DIEnumerator(name: "riscv32", value: 31, isUnsigned: true)
!252 = !DIEnumerator(name: "riscv64", value: 32, isUnsigned: true)
!253 = !DIEnumerator(name: "s390x", value: 33, isUnsigned: true)
!254 = !DIEnumerator(name: "sparc", value: 34, isUnsigned: true)
!255 = !DIEnumerator(name: "sparc64", value: 35, isUnsigned: true)
!256 = !DIEnumerator(name: "spirv32", value: 36, isUnsigned: true)
!257 = !DIEnumerator(name: "spirv64", value: 37, isUnsigned: true)
!258 = !DIEnumerator(name: "ve", value: 38, isUnsigned: true)
!259 = !DIEnumerator(name: "wasm32", value: 39, isUnsigned: true)
!260 = !DIEnumerator(name: "wasm64", value: 40, isUnsigned: true)
!261 = !DIEnumerator(name: "x86", value: 41, isUnsigned: true)
!262 = !DIEnumerator(name: "x86_64", value: 42, isUnsigned: true)
!263 = !DIEnumerator(name: "xcore", value: 43, isUnsigned: true)
!264 = !DIEnumerator(name: "xtensa", value: 44, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Os.WindowsVersion", scope: !266, file: !45, line: 311, baseType: !75, size: 32, align: 32, elements: !353)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os", scope: !47, size: 1536, align: 64, elements: !267)
!267 = !{!268, !310}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "version_range", scope: !266, baseType: !269, size: 1472, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os.VersionRange", scope: !47, size: 1472, align: 64, elements: !270)
!270 = !{!271, !302}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !269, baseType: !272, size: 1408, align: 64)
!272 = !DICompositeType(tag: DW_TAG_union_type, name: "Target.Os.VersionRange:Payload", scope: !47, size: 1408, align: 64, elements: !273)
!273 = !{!274, !286, !291, !297}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "semver", scope: !272, baseType: !275, size: 896, align: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemanticVersion.Range", scope: !47, size: 896, align: 64, elements: !276)
!276 = !{!277, !285}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !275, baseType: !278, size: 448, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemanticVersion", scope: !47, size: 448, align: 64, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !278, baseType: !110, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !278, baseType: !110, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !278, baseType: !110, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pre", scope: !278, baseType: !112, size: 128, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !278, baseType: !112, size: 128, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !275, baseType: !278, size: 448, align: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "hurd", scope: !272, baseType: !287, size: 1344, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os.HurdVersionRange", scope: !47, size: 1344, align: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !287, baseType: !275, size: 896, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "glibc", scope: !287, baseType: !278, size: 448, align: 64, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "linux", scope: !272, baseType: !292, size: 1408, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os.LinuxVersionRange", scope: !47, size: 1408, align: 64, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !292, baseType: !275, size: 896, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "glibc", scope: !292, baseType: !278, size: 448, align: 64, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "android", scope: !292, baseType: !75, size: 32, align: 32, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !272, baseType: !298, size: 64, align: 32)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os.WindowsVersion.Range", scope: !47, size: 64, align: 32, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !298, baseType: !265, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !298, baseType: !265, size: 32, align: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !269, baseType: !303, size: 8, align: 8, offset: 1408)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "@typeInfo(Target.Os.VersionRange).@\22union\22.tag_type.?", scope: !269, file: !45, line: 653, baseType: !158, size: 8, align: 8, elements: !304)
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!306 = !DIEnumerator(name: "semver", value: 1, isUnsigned: true)
!307 = !DIEnumerator(name: "hurd", value: 2, isUnsigned: true)
!308 = !DIEnumerator(name: "linux", value: 3, isUnsigned: true)
!309 = !DIEnumerator(name: "windows", value: 4, isUnsigned: true)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !266, baseType: !311, size: 8, align: 8, offset: 1472)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Os.Tag", scope: !266, file: !45, line: 213, baseType: !218, size: 8, align: 8, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!313 = !DIEnumerator(name: "freestanding", value: 0, isUnsigned: true)
!314 = !DIEnumerator(name: "other", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "contiki", value: 2, isUnsigned: true)
!316 = !DIEnumerator(name: "fuchsia", value: 3, isUnsigned: true)
!317 = !DIEnumerator(name: "hermit", value: 4, isUnsigned: true)
!318 = !DIEnumerator(name: "aix", value: 5, isUnsigned: true)
!319 = !DIEnumerator(name: "haiku", value: 6, isUnsigned: true)
!320 = !DIEnumerator(name: "hurd", value: 7, isUnsigned: true)
!321 = !DIEnumerator(name: "linux", value: 8, isUnsigned: true)
!322 = !DIEnumerator(name: "plan9", value: 9, isUnsigned: true)
!323 = !DIEnumerator(name: "rtems", value: 10, isUnsigned: true)
!324 = !DIEnumerator(name: "serenity", value: 11, isUnsigned: true)
!325 = !DIEnumerator(name: "zos", value: 12, isUnsigned: true)
!326 = !DIEnumerator(name: "dragonfly", value: 13, isUnsigned: true)
!327 = !DIEnumerator(name: "freebsd", value: 14, isUnsigned: true)
!328 = !DIEnumerator(name: "netbsd", value: 15, isUnsigned: true)
!329 = !DIEnumerator(name: "openbsd", value: 16, isUnsigned: true)
!330 = !DIEnumerator(name: "driverkit", value: 17, isUnsigned: true)
!331 = !DIEnumerator(name: "ios", value: 18, isUnsigned: true)
!332 = !DIEnumerator(name: "macos", value: 19, isUnsigned: true)
!333 = !DIEnumerator(name: "tvos", value: 20, isUnsigned: true)
!334 = !DIEnumerator(name: "visionos", value: 21, isUnsigned: true)
!335 = !DIEnumerator(name: "watchos", value: 22, isUnsigned: true)
!336 = !DIEnumerator(name: "illumos", value: 23, isUnsigned: true)
!337 = !DIEnumerator(name: "solaris", value: 24, isUnsigned: true)
!338 = !DIEnumerator(name: "windows", value: 25, isUnsigned: true)
!339 = !DIEnumerator(name: "uefi", value: 26, isUnsigned: true)
!340 = !DIEnumerator(name: "ps3", value: 27, isUnsigned: true)
!341 = !DIEnumerator(name: "ps4", value: 28, isUnsigned: true)
!342 = !DIEnumerator(name: "ps5", value: 29, isUnsigned: true)
!343 = !DIEnumerator(name: "emscripten", value: 30, isUnsigned: true)
!344 = !DIEnumerator(name: "wasi", value: 31, isUnsigned: true)
!345 = !DIEnumerator(name: "amdhsa", value: 32, isUnsigned: true)
!346 = !DIEnumerator(name: "amdpal", value: 33, isUnsigned: true)
!347 = !DIEnumerator(name: "cuda", value: 34, isUnsigned: true)
!348 = !DIEnumerator(name: "mesa3d", value: 35, isUnsigned: true)
!349 = !DIEnumerator(name: "nvcl", value: 36, isUnsigned: true)
!350 = !DIEnumerator(name: "opencl", value: 37, isUnsigned: true)
!351 = !DIEnumerator(name: "opengl", value: 38, isUnsigned: true)
!352 = !DIEnumerator(name: "vulkan", value: 39, isUnsigned: true)
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!354 = !DIEnumerator(name: "nt4", value: 67108864, isUnsigned: true)
!355 = !DIEnumerator(name: "win2k", value: 83886080, isUnsigned: true)
!356 = !DIEnumerator(name: "xp", value: 83951616, isUnsigned: true)
!357 = !DIEnumerator(name: "ws2003", value: 84017152, isUnsigned: true)
!358 = !DIEnumerator(name: "vista", value: 100663296, isUnsigned: true)
!359 = !DIEnumerator(name: "win7", value: 100728832, isUnsigned: true)
!360 = !DIEnumerator(name: "win8", value: 100794368, isUnsigned: true)
!361 = !DIEnumerator(name: "win8_1", value: 100859904, isUnsigned: true)
!362 = !DIEnumerator(name: "win10", value: 167772160, isUnsigned: true)
!363 = !DIEnumerator(name: "win10_th2", value: 167772161, isUnsigned: true)
!364 = !DIEnumerator(name: "win10_rs1", value: 167772162, isUnsigned: true)
!365 = !DIEnumerator(name: "win10_rs2", value: 167772163, isUnsigned: true)
!366 = !DIEnumerator(name: "win10_rs3", value: 167772164, isUnsigned: true)
!367 = !DIEnumerator(name: "win10_rs4", value: 167772165, isUnsigned: true)
!368 = !DIEnumerator(name: "win10_rs5", value: 167772166, isUnsigned: true)
!369 = !DIEnumerator(name: "win10_19h1", value: 167772167, isUnsigned: true)
!370 = !DIEnumerator(name: "win10_vb", value: 167772168, isUnsigned: true)
!371 = !DIEnumerator(name: "win10_mn", value: 167772169, isUnsigned: true)
!372 = !DIEnumerator(name: "win10_fe", value: 167772170, isUnsigned: true)
!373 = !DIEnumerator(name: "win10_co", value: 167772171, isUnsigned: true)
!374 = !DIEnumerator(name: "win10_ni", value: 167772172, isUnsigned: true)
!375 = !DIEnumerator(name: "win10_cu", value: 167772173, isUnsigned: true)
!376 = !DIEnumerator(name: "win11_zn", value: 167772174, isUnsigned: true)
!377 = !DIEnumerator(name: "win11_ga", value: 167772175, isUnsigned: true)
!378 = !DIEnumerator(name: "win11_ge", value: 167772176, isUnsigned: true)
!379 = !DIEnumerator(name: "win11_dt", value: 167772177, isUnsigned: true)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Abi", scope: !45, file: !45, line: 952, baseType: !381, size: 8, align: 8, elements: !382)
!381 = !DIBasicType(name: "u5", size: 8, encoding: DW_ATE_unsigned)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!383 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!384 = !DIEnumerator(name: "gnu", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "gnuabin32", value: 2, isUnsigned: true)
!386 = !DIEnumerator(name: "gnuabi64", value: 3, isUnsigned: true)
!387 = !DIEnumerator(name: "gnueabi", value: 4, isUnsigned: true)
!388 = !DIEnumerator(name: "gnueabihf", value: 5, isUnsigned: true)
!389 = !DIEnumerator(name: "gnuf32", value: 6, isUnsigned: true)
!390 = !DIEnumerator(name: "gnusf", value: 7, isUnsigned: true)
!391 = !DIEnumerator(name: "gnux32", value: 8, isUnsigned: true)
!392 = !DIEnumerator(name: "code16", value: 9, isUnsigned: true)
!393 = !DIEnumerator(name: "eabi", value: 10, isUnsigned: true)
!394 = !DIEnumerator(name: "eabihf", value: 11, isUnsigned: true)
!395 = !DIEnumerator(name: "ilp32", value: 12, isUnsigned: true)
!396 = !DIEnumerator(name: "android", value: 13, isUnsigned: true)
!397 = !DIEnumerator(name: "androideabi", value: 14, isUnsigned: true)
!398 = !DIEnumerator(name: "musl", value: 15, isUnsigned: true)
!399 = !DIEnumerator(name: "muslabin32", value: 16, isUnsigned: true)
!400 = !DIEnumerator(name: "muslabi64", value: 17, isUnsigned: true)
!401 = !DIEnumerator(name: "musleabi", value: 18, isUnsigned: true)
!402 = !DIEnumerator(name: "musleabihf", value: 19, isUnsigned: true)
!403 = !DIEnumerator(name: "muslf32", value: 20, isUnsigned: true)
!404 = !DIEnumerator(name: "muslsf", value: 21, isUnsigned: true)
!405 = !DIEnumerator(name: "muslx32", value: 22, isUnsigned: true)
!406 = !DIEnumerator(name: "msvc", value: 23, isUnsigned: true)
!407 = !DIEnumerator(name: "itanium", value: 24, isUnsigned: true)
!408 = !DIEnumerator(name: "cygnus", value: 25, isUnsigned: true)
!409 = !DIEnumerator(name: "simulator", value: 26, isUnsigned: true)
!410 = !DIEnumerator(name: "macabi", value: 27, isUnsigned: true)
!411 = !DIEnumerator(name: "ohos", value: 28, isUnsigned: true)
!412 = !DIEnumerator(name: "ohoseabi", value: 29, isUnsigned: true)
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.ObjectFormat", scope: !45, file: !45, line: 1007, baseType: !414, size: 8, align: 8, elements: !415)
!414 = !DIBasicType(name: "u4", size: 8, encoding: DW_ATE_unsigned)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!416 = !DIEnumerator(name: "c", value: 0, isUnsigned: true)
!417 = !DIEnumerator(name: "coff", value: 1, isUnsigned: true)
!418 = !DIEnumerator(name: "elf", value: 2, isUnsigned: true)
!419 = !DIEnumerator(name: "goff", value: 3, isUnsigned: true)
!420 = !DIEnumerator(name: "hex", value: 4, isUnsigned: true)
!421 = !DIEnumerator(name: "macho", value: 5, isUnsigned: true)
!422 = !DIEnumerator(name: "plan9", value: 6, isUnsigned: true)
!423 = !DIEnumerator(name: "raw", value: 7, isUnsigned: true)
!424 = !DIEnumerator(name: "spirv", value: 8, isUnsigned: true)
!425 = !DIEnumerator(name: "wasm", value: 9, isUnsigned: true)
!426 = !DIEnumerator(name: "xcoff", value: 10, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CallingConvention.ArmInterruptOptions.InterruptType", scope: !428, file: !24, line: 382, baseType: !158, size: 8, align: 8, elements: !432)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.ArmInterruptOptions", scope: !47, size: 192, align: 64, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !428, baseType: !133, size: 128, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, baseType: !427, size: 8, align: 8, offset: 128)
!432 = !{!433, !434, !435, !436, !437, !438}
!433 = !DIEnumerator(name: "generic", value: 0, isUnsigned: true)
!434 = !DIEnumerator(name: "irq", value: 1, isUnsigned: true)
!435 = !DIEnumerator(name: "fiq", value: 2, isUnsigned: true)
!436 = !DIEnumerator(name: "swi", value: 3, isUnsigned: true)
!437 = !DIEnumerator(name: "abort", value: 4, isUnsigned: true)
!438 = !DIEnumerator(name: "undef", value: 5, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CallingConvention.MipsInterruptOptions.InterruptMode", scope: !440, file: !24, line: 400, baseType: !414, size: 8, align: 8, elements: !444)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.MipsInterruptOptions", scope: !47, size: 192, align: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !440, baseType: !133, size: 128, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !440, baseType: !439, size: 8, align: 8, offset: 128)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453}
!445 = !DIEnumerator(name: "eic", value: 0, isUnsigned: true)
!446 = !DIEnumerator(name: "sw0", value: 1, isUnsigned: true)
!447 = !DIEnumerator(name: "sw1", value: 2, isUnsigned: true)
!448 = !DIEnumerator(name: "hw0", value: 3, isUnsigned: true)
!449 = !DIEnumerator(name: "hw1", value: 4, isUnsigned: true)
!450 = !DIEnumerator(name: "hw2", value: 5, isUnsigned: true)
!451 = !DIEnumerator(name: "hw3", value: 6, isUnsigned: true)
!452 = !DIEnumerator(name: "hw4", value: 7, isUnsigned: true)
!453 = !DIEnumerator(name: "hw5", value: 8, isUnsigned: true)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CallingConvention.RiscvInterruptOptions.PrivilegeMode", scope: !455, file: !24, line: 421, baseType: !117, size: 8, align: 8, elements: !459)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.RiscvInterruptOptions", scope: !47, size: 192, align: 64, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !455, baseType: !133, size: 128, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !455, baseType: !454, size: 8, align: 8, offset: 128)
!459 = !{!460, !461}
!460 = !DIEnumerator(name: "supervisor", value: 0, isUnsigned: true)
!461 = !DIEnumerator(name: "machine", value: 1, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "@typeInfo(builtin.CallingConvention).@\22union\22.tag_type.?", scope: !463, file: !24, line: 442, baseType: !73, size: 8, align: 8, elements: !546)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention", scope: !47, size: 256, align: 64, elements: !464)
!464 = !{!465, !545}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !463, baseType: !466, size: 192, align: 64)
!466 = !DICompositeType(tag: DW_TAG_union_type, name: "builtin.CallingConvention:Payload", scope: !47, size: 192, align: 64, elements: !467)
!467 = !{!468, !472, !473, !474, !475, !476, !477, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.CommonOptions", scope: !47, size: 128, align: 64, elements: !470)
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !469, baseType: !133, size: 128, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_win", scope: !466, baseType: !469, size: 128, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_regcall_v3_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_regcall_v4_win", scope: !466, baseType: !469, size: 128, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_vectorcall", scope: !466, baseType: !469, size: 128, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_interrupt", scope: !466, baseType: !469, size: 128, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "x86_sysv", scope: !466, baseType: !478, size: 192, align: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.X86RegparmOptions", scope: !47, size: 192, align: 64, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !478, baseType: !133, size: 128, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "register_params", scope: !478, baseType: !117, size: 8, align: 8, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "x86_win", scope: !466, baseType: !478, size: 192, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "x86_stdcall", scope: !466, baseType: !478, size: 192, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "x86_fastcall", scope: !466, baseType: !469, size: 128, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "x86_thiscall", scope: !466, baseType: !469, size: 128, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "x86_thiscall_mingw", scope: !466, baseType: !469, size: 128, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x86_regcall_v3", scope: !466, baseType: !469, size: 128, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "x86_regcall_v4_win", scope: !466, baseType: !469, size: 128, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vectorcall", scope: !466, baseType: !469, size: 128, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "x86_interrupt", scope: !466, baseType: !469, size: 128, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_aapcs", scope: !466, baseType: !469, size: 128, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_aapcs_darwin", scope: !466, baseType: !469, size: 128, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_aapcs_win", scope: !466, baseType: !469, size: 128, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_vfabi", scope: !466, baseType: !469, size: 128, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_vfabi_sve", scope: !466, baseType: !469, size: 128, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "arm_aapcs", scope: !466, baseType: !469, size: 128, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "arm_aapcs_vfp", scope: !466, baseType: !469, size: 128, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "arm_interrupt", scope: !466, baseType: !428, size: 192, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mips64_n64", scope: !466, baseType: !469, size: 128, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mips64_n32", scope: !466, baseType: !469, size: 128, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mips64_interrupt", scope: !466, baseType: !440, size: 192, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mips_o32", scope: !466, baseType: !469, size: 128, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mips_interrupt", scope: !466, baseType: !440, size: 192, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "riscv64_lp64", scope: !466, baseType: !469, size: 128, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "riscv64_lp64_v", scope: !466, baseType: !469, size: 128, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "riscv64_interrupt", scope: !466, baseType: !455, size: 192, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "riscv32_ilp32", scope: !466, baseType: !469, size: 128, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "riscv32_ilp32_v", scope: !466, baseType: !469, size: 128, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "riscv32_interrupt", scope: !466, baseType: !455, size: 192, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sparc64_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sparc_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc64_elf", scope: !466, baseType: !469, size: 128, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc64_elf_altivec", scope: !466, baseType: !469, size: 128, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc64_elf_v2", scope: !466, baseType: !469, size: 128, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_sysv_altivec", scope: !466, baseType: !469, size: 128, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_aix", scope: !466, baseType: !469, size: 128, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_aix_altivec", scope: !466, baseType: !469, size: 128, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "wasm_mvp", scope: !466, baseType: !469, size: 128, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "arc_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_std", scope: !466, baseType: !469, size: 128, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "csky_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "csky_interrupt", scope: !466, baseType: !469, size: 128, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "hexagon_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hexagon_sysv_hvx", scope: !466, baseType: !469, size: 128, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lanai_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "loongarch64_lp64", scope: !466, baseType: !469, size: 128, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "loongarch32_ilp32", scope: !466, baseType: !469, size: 128, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_gnu", scope: !466, baseType: !469, size: 128, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_rtd", scope: !466, baseType: !469, size: 128, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_interrupt", scope: !466, baseType: !469, size: 128, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "msp430_eabi", scope: !466, baseType: !469, size: 128, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "or1k_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "propeller_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "s390x_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "s390x_sysv_vx", scope: !466, baseType: !469, size: 128, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ve_sysv", scope: !466, baseType: !469, size: 128, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "xcore_xs1", scope: !466, baseType: !469, size: 128, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "xcore_xs2", scope: !466, baseType: !469, size: 128, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "xtensa_call0", scope: !466, baseType: !469, size: 128, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "xtensa_windowed", scope: !466, baseType: !469, size: 128, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "amdgcn_device", scope: !466, baseType: !469, size: 128, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "amdgcn_cs", scope: !466, baseType: !469, size: 128, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !463, baseType: !462, size: 8, align: 8, offset: 192)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!547 = !DIEnumerator(name: "auto", value: 0, isUnsigned: true)
!548 = !DIEnumerator(name: "async", value: 1, isUnsigned: true)
!549 = !DIEnumerator(name: "naked", value: 2, isUnsigned: true)
!550 = !DIEnumerator(name: "inline", value: 3, isUnsigned: true)
!551 = !DIEnumerator(name: "x86_64_sysv", value: 4, isUnsigned: true)
!552 = !DIEnumerator(name: "x86_64_win", value: 5, isUnsigned: true)
!553 = !DIEnumerator(name: "x86_64_regcall_v3_sysv", value: 6, isUnsigned: true)
!554 = !DIEnumerator(name: "x86_64_regcall_v4_win", value: 7, isUnsigned: true)
!555 = !DIEnumerator(name: "x86_64_vectorcall", value: 8, isUnsigned: true)
!556 = !DIEnumerator(name: "x86_64_interrupt", value: 9, isUnsigned: true)
!557 = !DIEnumerator(name: "x86_sysv", value: 10, isUnsigned: true)
!558 = !DIEnumerator(name: "x86_win", value: 11, isUnsigned: true)
!559 = !DIEnumerator(name: "x86_stdcall", value: 12, isUnsigned: true)
!560 = !DIEnumerator(name: "x86_fastcall", value: 13, isUnsigned: true)
!561 = !DIEnumerator(name: "x86_thiscall", value: 14, isUnsigned: true)
!562 = !DIEnumerator(name: "x86_thiscall_mingw", value: 15, isUnsigned: true)
!563 = !DIEnumerator(name: "x86_regcall_v3", value: 16, isUnsigned: true)
!564 = !DIEnumerator(name: "x86_regcall_v4_win", value: 17, isUnsigned: true)
!565 = !DIEnumerator(name: "x86_vectorcall", value: 18, isUnsigned: true)
!566 = !DIEnumerator(name: "x86_interrupt", value: 19, isUnsigned: true)
!567 = !DIEnumerator(name: "aarch64_aapcs", value: 20, isUnsigned: true)
!568 = !DIEnumerator(name: "aarch64_aapcs_darwin", value: 21, isUnsigned: true)
!569 = !DIEnumerator(name: "aarch64_aapcs_win", value: 22, isUnsigned: true)
!570 = !DIEnumerator(name: "aarch64_vfabi", value: 23, isUnsigned: true)
!571 = !DIEnumerator(name: "aarch64_vfabi_sve", value: 24, isUnsigned: true)
!572 = !DIEnumerator(name: "arm_aapcs", value: 25, isUnsigned: true)
!573 = !DIEnumerator(name: "arm_aapcs_vfp", value: 26, isUnsigned: true)
!574 = !DIEnumerator(name: "arm_interrupt", value: 27, isUnsigned: true)
!575 = !DIEnumerator(name: "mips64_n64", value: 28, isUnsigned: true)
!576 = !DIEnumerator(name: "mips64_n32", value: 29, isUnsigned: true)
!577 = !DIEnumerator(name: "mips64_interrupt", value: 30, isUnsigned: true)
!578 = !DIEnumerator(name: "mips_o32", value: 31, isUnsigned: true)
!579 = !DIEnumerator(name: "mips_interrupt", value: 32, isUnsigned: true)
!580 = !DIEnumerator(name: "riscv64_lp64", value: 33, isUnsigned: true)
!581 = !DIEnumerator(name: "riscv64_lp64_v", value: 34, isUnsigned: true)
!582 = !DIEnumerator(name: "riscv64_interrupt", value: 35, isUnsigned: true)
!583 = !DIEnumerator(name: "riscv32_ilp32", value: 36, isUnsigned: true)
!584 = !DIEnumerator(name: "riscv32_ilp32_v", value: 37, isUnsigned: true)
!585 = !DIEnumerator(name: "riscv32_interrupt", value: 38, isUnsigned: true)
!586 = !DIEnumerator(name: "sparc64_sysv", value: 39, isUnsigned: true)
!587 = !DIEnumerator(name: "sparc_sysv", value: 40, isUnsigned: true)
!588 = !DIEnumerator(name: "powerpc64_elf", value: 41, isUnsigned: true)
!589 = !DIEnumerator(name: "powerpc64_elf_altivec", value: 42, isUnsigned: true)
!590 = !DIEnumerator(name: "powerpc64_elf_v2", value: 43, isUnsigned: true)
!591 = !DIEnumerator(name: "powerpc_sysv", value: 44, isUnsigned: true)
!592 = !DIEnumerator(name: "powerpc_sysv_altivec", value: 45, isUnsigned: true)
!593 = !DIEnumerator(name: "powerpc_aix", value: 46, isUnsigned: true)
!594 = !DIEnumerator(name: "powerpc_aix_altivec", value: 47, isUnsigned: true)
!595 = !DIEnumerator(name: "wasm_mvp", value: 48, isUnsigned: true)
!596 = !DIEnumerator(name: "arc_sysv", value: 49, isUnsigned: true)
!597 = !DIEnumerator(name: "avr_gnu", value: 50, isUnsigned: true)
!598 = !DIEnumerator(name: "avr_builtin", value: 51, isUnsigned: true)
!599 = !DIEnumerator(name: "avr_signal", value: 52, isUnsigned: true)
!600 = !DIEnumerator(name: "avr_interrupt", value: 53, isUnsigned: true)
!601 = !DIEnumerator(name: "bpf_std", value: 54, isUnsigned: true)
!602 = !DIEnumerator(name: "csky_sysv", value: 55, isUnsigned: true)
!603 = !DIEnumerator(name: "csky_interrupt", value: 56, isUnsigned: true)
!604 = !DIEnumerator(name: "hexagon_sysv", value: 57, isUnsigned: true)
!605 = !DIEnumerator(name: "hexagon_sysv_hvx", value: 58, isUnsigned: true)
!606 = !DIEnumerator(name: "lanai_sysv", value: 59, isUnsigned: true)
!607 = !DIEnumerator(name: "loongarch64_lp64", value: 60, isUnsigned: true)
!608 = !DIEnumerator(name: "loongarch32_ilp32", value: 61, isUnsigned: true)
!609 = !DIEnumerator(name: "m68k_sysv", value: 62, isUnsigned: true)
!610 = !DIEnumerator(name: "m68k_gnu", value: 63, isUnsigned: true)
!611 = !DIEnumerator(name: "m68k_rtd", value: 64, isUnsigned: true)
!612 = !DIEnumerator(name: "m68k_interrupt", value: 65, isUnsigned: true)
!613 = !DIEnumerator(name: "msp430_eabi", value: 66, isUnsigned: true)
!614 = !DIEnumerator(name: "or1k_sysv", value: 67, isUnsigned: true)
!615 = !DIEnumerator(name: "propeller_sysv", value: 68, isUnsigned: true)
!616 = !DIEnumerator(name: "s390x_sysv", value: 69, isUnsigned: true)
!617 = !DIEnumerator(name: "s390x_sysv_vx", value: 70, isUnsigned: true)
!618 = !DIEnumerator(name: "ve_sysv", value: 71, isUnsigned: true)
!619 = !DIEnumerator(name: "xcore_xs1", value: 72, isUnsigned: true)
!620 = !DIEnumerator(name: "xcore_xs2", value: 73, isUnsigned: true)
!621 = !DIEnumerator(name: "xtensa_call0", value: 74, isUnsigned: true)
!622 = !DIEnumerator(name: "xtensa_windowed", value: 75, isUnsigned: true)
!623 = !DIEnumerator(name: "amdgcn_device", value: 76, isUnsigned: true)
!624 = !DIEnumerator(name: "amdgcn_kernel", value: 77, isUnsigned: true)
!625 = !DIEnumerator(name: "amdgcn_cs", value: 78, isUnsigned: true)
!626 = !DIEnumerator(name: "nvptx_device", value: 79, isUnsigned: true)
!627 = !DIEnumerator(name: "nvptx_kernel", value: 80, isUnsigned: true)
!628 = !DIEnumerator(name: "spirv_device", value: 81, isUnsigned: true)
!629 = !DIEnumerator(name: "spirv_kernel", value: 82, isUnsigned: true)
!630 = !DIEnumerator(name: "spirv_fragment", value: 83, isUnsigned: true)
!631 = !DIEnumerator(name: "spirv_vertex", value: 84, isUnsigned: true)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.OptimizeMode", scope: !24, file: !24, line: 154, baseType: !117, size: 8, align: 8, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIEnumerator(name: "Debug", value: 0, isUnsigned: true)
!635 = !DIEnumerator(name: "ReleaseSafe", value: 1, isUnsigned: true)
!636 = !DIEnumerator(name: "ReleaseFast", value: 2, isUnsigned: true)
!637 = !DIEnumerator(name: "ReleaseSmall", value: 3, isUnsigned: true)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log.Level", scope: !639, file: !639, line: 98, baseType: !117, size: 8, align: 8, elements: !640)
!639 = !DIFile(filename: "log.zig", directory: "/usr/local/lib/zig/std")
!640 = !{!641, !642, !643, !644}
!641 = !DIEnumerator(name: "err", value: 0, isUnsigned: true)
!642 = !DIEnumerator(name: "warn", value: 1, isUnsigned: true)
!643 = !DIEnumerator(name: "info", value: 2, isUnsigned: true)
!644 = !DIEnumerator(name: "debug", value: 3, isUnsigned: true)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "crypto.SideChannelsMitigations", scope: !646, file: !646, line: 225, baseType: !117, size: 8, align: 8, elements: !647)
!646 = !DIFile(filename: "crypto.zig", directory: "/usr/local/lib/zig/std")
!647 = !{!119, !648, !649, !650}
!648 = !DIEnumerator(name: "basic", value: 1, isUnsigned: true)
!649 = !DIEnumerator(name: "medium", value: 2, isUnsigned: true)
!650 = !DIEnumerator(name: "full", value: 3, isUnsigned: true)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.OutputMode", scope: !24, file: !24, line: 782, baseType: !117, size: 8, align: 8, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIEnumerator(name: "Exe", value: 0, isUnsigned: true)
!654 = !DIEnumerator(name: "Lib", value: 1, isUnsigned: true)
!655 = !DIEnumerator(name: "Obj", value: 2, isUnsigned: true)
!656 = !{!20, !39, !43, !657, !659, !661, !663, !665, !674, !683, !685, !687, !690, !692, !695, !697, !699, !701, !704, !706, !708, !710, !712, !728, !730, !733, !735, !742, !10, !744, !749, !754, !757, !759, !761, !763, !0, !18}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "cpu", linkageName: "builtin.cpu", scope: !22, file: !22, line: 14, type: !207, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "os", linkageName: "builtin.os", scope: !22, file: !22, line: 104, type: !266, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "abi", linkageName: "builtin.abi", scope: !22, file: !22, line: 13, type: !380, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "object_format", linkageName: "builtin.object_format", scope: !22, file: !22, line: 115, type: !413, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "none", linkageName: "Target.DynamicLinker.none", scope: !45, file: !45, line: 2072, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.DynamicLinker", scope: !47, size: 2048, align: 8, elements: !668)
!668 = !{!669, !673}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !667, baseType: !670, size: 2040, align: 8)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 2040, align: 8, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 255, lowerBound: 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !667, baseType: !73, size: 8, align: 8, offset: 2040)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "target", linkageName: "builtin.target", scope: !22, file: !22, line: 108, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target", scope: !47, size: 4096, align: 64, elements: !677)
!677 = !{!678, !679, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !676, baseType: !207, size: 448, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !676, baseType: !266, size: 1536, align: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !676, baseType: !380, size: 8, align: 8, offset: 1984)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ofmt", scope: !676, baseType: !413, size: 8, align: 8, offset: 1992)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_linker", scope: !676, baseType: !667, size: 2048, align: 8, offset: 2000)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "c", linkageName: "builtin.CallingConvention.c", scope: !24, file: !24, line: 172, type: !463, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "link_libc", linkageName: "builtin.link_libc", scope: !22, file: !22, line: 117, type: !42, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "native_os", linkageName: "posix.native_os", scope: !689, file: !689, line: 26, type: !311, isLocal: true, isDefinition: true)
!689 = !DIFile(filename: "posix.zig", directory: "/usr/local/lib/zig/std")
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "use_libc", linkageName: "posix.use_libc", scope: !689, file: !689, line: 34, type: !42, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "use_vectors", linkageName: "mem.use_vectors", scope: !694, file: !694, line: 677, type: !42, isLocal: true, isDefinition: true)
!694 = !DIFile(filename: "mem.zig", directory: "/usr/local/lib/zig/std")
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "fuzz", linkageName: "builtin.fuzz", scope: !22, file: !22, line: 122, type: !42, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "use_vectors_for_comparison", linkageName: "mem.use_vectors_for_comparison", scope: !694, file: !694, line: 689, type: !42, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "mode", linkageName: "builtin.mode", scope: !22, file: !22, line: 116, type: !632, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "runtime_safety", linkageName: "debug.runtime_safety", scope: !703, file: !703, line: 166, type: !42, isLocal: true, isDefinition: true)
!703 = !DIFile(filename: "debug.zig", directory: "/usr/local/lib/zig/std")
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "native_os", linkageName: "debug.native_os", scope: !703, file: !703, line: 13, type: !311, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "have_segfault_handling_support", linkageName: "debug.have_segfault_handling_support", scope: !703, file: !703, line: 1378, type: !42, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "default_enable_segfault_handler", linkageName: "debug.default_enable_segfault_handler", scope: !703, file: !703, line: 1392, type: !42, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "default_level", linkageName: "log.default_level", scope: !639, file: !639, line: 102, type: !638, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "options", linkageName: "std.options", scope: !714, file: !714, line: 115, type: !715, isLocal: true, isDefinition: true)
!714 = !DIFile(filename: "std.zig", directory: "/usr/local/lib/zig/std")
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Options", scope: !47, size: 384, align: 64, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "page_size_min", scope: !715, baseType: !183, size: 128, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "page_size_max", scope: !715, baseType: !183, size: 128, align: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_max_depth", scope: !715, baseType: !110, size: 64, align: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "enable_segfault_handler", scope: !715, baseType: !42, size: 8, align: 8, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !715, baseType: !638, size: 8, align: 8, offset: 328)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "crypto_always_getrandom", scope: !715, baseType: !42, size: 8, align: 8, offset: 336)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "crypto_fork_safety", scope: !715, baseType: !42, size: 8, align: 8, offset: 344)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "keep_sigpipe", scope: !715, baseType: !42, size: 8, align: 8, offset: 352)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "http_disable_tls", scope: !715, baseType: !42, size: 8, align: 8, offset: 360)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "http_enable_ssl_key_log_file", scope: !715, baseType: !42, size: 8, align: 8, offset: 368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "side_channels_mitigations", scope: !715, baseType: !645, size: 8, align: 8, offset: 376)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "valgrind_support", linkageName: "builtin.valgrind_support", scope: !22, file: !22, line: 120, type: !42, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "page_size_min_default", linkageName: "heap.page_size_min_default", scope: !732, file: !732, line: 696, type: !183, isLocal: true, isDefinition: true)
!732 = !DIFile(filename: "heap.zig", directory: "/usr/local/lib/zig/std")
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "page_size_min", linkageName: "heap.page_size_min", scope: !732, file: !732, line: 46, type: !110, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "ANY", linkageName: "Io.Writer.ANY", scope: !737, file: !737, line: 1763, type: !738, isLocal: true, isDefinition: true)
!737 = !DIFile(filename: "Writer.zig", directory: "/usr/local/lib/zig/std/Io")
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[3:0]u8", baseType: !739, size: 64, align: 8)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, align: 8, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 3, lowerBound: 0)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "adjust_q", linkageName: "fmt.float.Backend128_Tables.adjust_q", scope: !2, file: !2, line: 640, type: !42, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "FLOAT128_POW5_INV_ERRORS", linkageName: "fmt.float.FLOAT128_POW5_INV_ERRORS", scope: !2, file: !2, line: 1472, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 9856, align: 64, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 154, lowerBound: 0)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "FLOAT128_POW5_ERRORS", linkageName: "fmt.float.FLOAT128_POW5_ERRORS", scope: !2, file: !2, line: 1338, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 9984, align: 64, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 156, lowerBound: 0)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "simplified_logic", linkageName: "start.simplified_logic", scope: !756, file: !756, line: 17, type: !42, isLocal: true, isDefinition: true)
!756 = !DIFile(filename: "start.zig", directory: "/usr/local/lib/zig/std")
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "output_mode", linkageName: "builtin.output_mode", scope: !22, file: !22, line: 8, type: !651, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "native_os", linkageName: "start.native_os", scope: !756, file: !756, line: 10, type: !311, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "native_arch", linkageName: "start.native_arch", scope: !756, file: !756, line: 9, type: !206, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "znver4", linkageName: "Target.x86.cpu.znver4", scope: !765, file: !765, line: 4924, type: !211, isLocal: true, isDefinition: true)
!765 = !DIFile(filename: "x86.zig", directory: "/usr/local/lib/zig/std/Target")
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !46, baseType: !768, size: 320, align: 64)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 320, align: 64, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 5, lowerBound: 0)
!771 = !{i32 2, !"Debug Info Version", i32 3}
!772 = !{i32 7, !"Dwarf Version", i32 4}
!773 = distinct !DISubprogram(name: "handler", linkageName: "ubsan_rt.overflowHandler.S.handler", scope: !41, file: !41, line: 161, type: !774, scopeLine: 165, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !777, !782, !782}
!776 = !DIBasicType(name: "void", encoding: DW_ATE_signed)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*ubsan_rt.OverflowData", baseType: !778, size: 64, align: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.OverflowData", scope: !47, size: 192, align: 64, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !778, baseType: !69, size: 128, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !778, baseType: !86, size: 64, align: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*ubsan_rt.ValueHandle__opaque_203", baseType: !783, size: 64, align: 8)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.ValueHandle__opaque_203", scope: !41, file: !41, line: 46)
!784 = !DILocation(line: 165, column: 33, scope: !773)
!785 = !DILocalVariable(name: "data", arg: 1, scope: !773, file: !41, line: 165, type: !777)
!786 = !DILocalVariable(name: "lhs_handle", arg: 2, scope: !773, file: !41, line: 165, type: !782)
!787 = !DILocalVariable(name: "rhs_handle", arg: 3, scope: !773, file: !41, line: 165, type: !782)
!788 = !DILocation(line: 166, column: 13, scope: !773)
!789 = !DILocation(line: 166, column: 67, scope: !773)
!790 = !DILocalVariable(name: "lhs", scope: !773, file: !41, line: 166, type: !791)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.Value", scope: !47, size: 128, align: 64, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !791, baseType: !86, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !791, baseType: !782, size: 64, align: 64, offset: 64)
!795 = !DILocation(line: 167, column: 13, scope: !773)
!796 = !DILocation(line: 167, column: 67, scope: !773)
!797 = !DILocalVariable(name: "rhs", scope: !773, file: !41, line: 167, type: !791)
!798 = !DILocation(line: 168, column: 40, scope: !799)
!799 = !DILexicalBlock(scope: !773, file: !41, line: 168, column: 36)
!800 = !DILocation(line: 168, column: 52, scope: !799)
!801 = !DILocation(line: 168, column: 52, scope: !773)
!802 = !DILocalVariable(name: "signed_str", scope: !773, file: !41, line: 168, type: !112)
!803 = !DILocation(line: 169, column: 18, scope: !773)
!804 = !DILocation(line: 172, column: 46, scope: !773)
!805 = !DILocation(line: 172, column: 57, scope: !773)
!806 = !DILocation(line: 168, column: 52, scope: !807)
!807 = !DILexicalBlock(scope: !799, file: !41, line: 168, column: 52)
!808 = distinct !DISubprogram(name: "isSigned", linkageName: "ubsan_rt.TypeDescriptor.isSigned", scope: !41, file: !41, line: 37, type: !809, scopeLine: 37, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!809 = !DISubroutineType(types: !810)
!810 = !{!42, !811, !86}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*usize", baseType: !110, size: 64, align: 64)
!812 = !DILocalVariable(name: "desc", arg: 1, scope: !808, file: !41, line: 37, type: !51)
!813 = !DILocation(line: 37, column: 44, scope: !808)
!814 = !DILocation(line: 38, column: 20, scope: !808)
!815 = !DILocation(line: 38, column: 20, scope: !816)
!816 = !DILexicalBlock(scope: !808, file: !41, line: 38, column: 20)
!817 = !DILocation(line: 38, column: 59, scope: !808)
!818 = !DILocation(line: 38, column: 9, scope: !808)
!819 = !DILocation(line: 38, column: 46, scope: !820)
!820 = !DILexicalBlock(scope: !816, file: !41, line: 38, column: 20)
!821 = !DILocation(line: 38, column: 51, scope: !820)
!822 = !DILocation(line: 38, column: 59, scope: !820)
!823 = !DILocation(line: 38, column: 59, scope: !824)
!824 = !DILexicalBlock(scope: !816, file: !41, line: 38, column: 59)
!825 = distinct !DISubprogram(name: "getName", linkageName: "ubsan_rt.TypeDescriptor.getName", scope: !41, file: !41, line: 41, type: !826, scopeLine: 41, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!826 = !DISubroutineType(types: !827)
!827 = !{!112, !811, !86}
!828 = !DILocation(line: 41, column: 58, scope: !825)
!829 = !DILocalVariable(name: "desc", arg: 1, scope: !825, file: !41, line: 41, type: !86)
!830 = !DILocation(line: 42, column: 64, scope: !825)
!831 = !DILocation(line: 42, column: 28, scope: !825)
!832 = !DILocation(line: 42, column: 9, scope: !825)
!833 = distinct !DISubprogram(name: "panicExtra__anon_2377", linkageName: "debug.panicExtra__anon_2377", scope: !703, file: !703, line: 584, type: !834, scopeLine: 588, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!834 = !DISubroutineType(types: !835)
!835 = !{!776, !811, !836, !837}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*?usize", baseType: !183, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*struct { [:0]const u8, ubsan_rt.Value, ubsan_rt.Value, [:0]const u8 }", baseType: !838, size: 64, align: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct { [:0]const u8, ubsan_rt.Value, ubsan_rt.Value, [:0]const u8 }", scope: !47, size: 512, align: 64, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "0", scope: !838, baseType: !112, size: 128, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "1", scope: !838, baseType: !791, size: 128, align: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "2", scope: !838, baseType: !791, size: 128, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "3", scope: !838, baseType: !112, size: 128, align: 64, offset: 384)
!844 = !DILocalVariable(name: "ret_addr", arg: 1, scope: !833, file: !703, line: 588, type: !183)
!845 = !DILocation(line: 588, column: 12, scope: !833)
!846 = !DILocalVariable(name: "args", arg: 2, scope: !833, file: !703, line: 588, type: !838)
!847 = !DILocation(line: 592, column: 5, scope: !833)
!848 = !DILocalVariable(name: "trunc_msg", scope: !833, file: !703, line: 592, type: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[15:0]u8", baseType: !850, size: 64, align: 8)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 128, align: 8, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 15, lowerBound: 0)
!853 = !DILocation(line: 593, column: 5, scope: !833)
!854 = !DILocalVariable(name: "buf", scope: !833, file: !703, line: 593, type: !855)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32888, align: 8, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 4111, lowerBound: 0)
!858 = !DILocation(line: 594, column: 32, scope: !833)
!859 = !DILocation(line: 594, column: 32, scope: !860)
!860 = !DILexicalBlock(scope: !833, file: !703, line: 594, column: 32)
!861 = !DILocation(line: 594, column: 28, scope: !833)
!862 = !DILocalVariable(name: "bw", scope: !833, file: !703, line: 594, type: !863)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "Io.Writer", scope: !47, size: 256, align: 64, elements: !864)
!864 = !{!865, !873, !874}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !863, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*Io.Writer.VTable", baseType: !867, size: 64, align: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Io.Writer.VTable", scope: !47, size: 256, align: 64, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "drain", scope: !867, baseType: !145, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sendFile", scope: !867, baseType: !145, size: 64, align: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !867, baseType: !145, size: 64, align: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rebase", scope: !867, baseType: !145, size: 64, align: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !863, baseType: !112, size: 128, align: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !863, baseType: !110, size: 64, align: 64, offset: 192)
!875 = !DILocation(line: 598, column: 29, scope: !876)
!876 = !DILexicalBlock(scope: !833, file: !703, line: 598, column: 21)
!877 = !DILocation(line: 594, column: 32, scope: !878)
!878 = !DILexicalBlock(scope: !860, file: !703, line: 594, column: 32)
!879 = !DILocation(line: 600, column: 9, scope: !833)
!880 = !DILocalVariable(name: "msg", scope: !833, file: !703, line: 600, type: !112)
!881 = !DILocation(line: 602, column: 27, scope: !833)
!882 = !DILocation(line: 598, column: 60, scope: !883)
!883 = !DILexicalBlock(scope: !876, file: !703, line: 598, column: 29)
!884 = !DILocation(line: 599, column: 20, scope: !885)
!885 = !DILexicalBlock(scope: !876, file: !703, line: 598, column: 60)
!886 = !DILocation(line: 599, column: 20, scope: !887)
!887 = !DILexicalBlock(scope: !885, file: !703, line: 599, column: 20)
!888 = !DILocation(line: 599, column: 20, scope: !889)
!889 = !DILexicalBlock(scope: !887, file: !703, line: 599, column: 20)
!890 = !DILocation(line: 600, column: 9, scope: !885)
!891 = !DILocation(line: 600, column: 9, scope: !892)
!892 = !DILexicalBlock(scope: !885, file: !703, line: 600, column: 9)
!893 = distinct !DISubprogram(name: "abort", linkageName: "ubsan_rt.overflowHandler.S.abort", scope: !41, file: !41, line: 153, type: !774, scopeLine: 157, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!894 = !DILocation(line: 157, column: 33, scope: !893)
!895 = !DILocalVariable(name: "data", arg: 1, scope: !893, file: !41, line: 157, type: !777)
!896 = !DILocalVariable(name: "lhs_handle", arg: 2, scope: !893, file: !41, line: 157, type: !782)
!897 = !DILocalVariable(name: "rhs_handle", arg: 3, scope: !893, file: !41, line: 157, type: !782)
!898 = !DILocation(line: 158, column: 20, scope: !893)
!899 = distinct !DISubprogram(name: "handler", linkageName: "ubsan_rt.overflowHandler.S.handler.2", scope: !41, file: !41, line: 161, type: !774, scopeLine: 165, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!900 = !DILocation(line: 165, column: 33, scope: !899)
!901 = !DILocalVariable(name: "data", arg: 1, scope: !899, file: !41, line: 165, type: !777)
!902 = !DILocalVariable(name: "lhs_handle", arg: 2, scope: !899, file: !41, line: 165, type: !782)
!903 = !DILocalVariable(name: "rhs_handle", arg: 3, scope: !899, file: !41, line: 165, type: !782)
!904 = !DILocation(line: 166, column: 13, scope: !899)
!905 = !DILocation(line: 166, column: 67, scope: !899)
!906 = !DILocalVariable(name: "lhs", scope: !899, file: !41, line: 166, type: !791)
!907 = !DILocation(line: 167, column: 13, scope: !899)
!908 = !DILocation(line: 167, column: 67, scope: !899)
!909 = !DILocalVariable(name: "rhs", scope: !899, file: !41, line: 167, type: !791)
!910 = !DILocation(line: 168, column: 40, scope: !911)
!911 = !DILexicalBlock(scope: !899, file: !41, line: 168, column: 36)
!912 = !DILocation(line: 168, column: 52, scope: !911)
!913 = !DILocation(line: 168, column: 52, scope: !899)
!914 = !DILocalVariable(name: "signed_str", scope: !899, file: !41, line: 168, type: !112)
!915 = !DILocation(line: 169, column: 18, scope: !899)
!916 = !DILocation(line: 172, column: 46, scope: !899)
!917 = !DILocation(line: 172, column: 57, scope: !899)
!918 = !DILocation(line: 168, column: 52, scope: !919)
!919 = !DILexicalBlock(scope: !911, file: !41, line: 168, column: 52)
!920 = distinct !DISubprogram(name: "panicExtra__anon_2390", linkageName: "debug.panicExtra__anon_2390", scope: !703, file: !703, line: 584, type: !834, scopeLine: 588, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!921 = !DILocalVariable(name: "ret_addr", arg: 1, scope: !920, file: !703, line: 588, type: !183)
!922 = !DILocation(line: 588, column: 12, scope: !920)
!923 = !DILocalVariable(name: "args", arg: 2, scope: !920, file: !703, line: 588, type: !838)
!924 = !DILocation(line: 592, column: 5, scope: !920)
!925 = !DILocalVariable(name: "trunc_msg", scope: !920, file: !703, line: 592, type: !849)
!926 = !DILocation(line: 593, column: 5, scope: !920)
!927 = !DILocalVariable(name: "buf", scope: !920, file: !703, line: 593, type: !855)
!928 = !DILocation(line: 594, column: 32, scope: !920)
!929 = !DILocation(line: 594, column: 32, scope: !930)
!930 = !DILexicalBlock(scope: !920, file: !703, line: 594, column: 32)
!931 = !DILocation(line: 594, column: 28, scope: !920)
!932 = !DILocalVariable(name: "bw", scope: !920, file: !703, line: 594, type: !863)
!933 = !DILocation(line: 598, column: 29, scope: !934)
!934 = !DILexicalBlock(scope: !920, file: !703, line: 598, column: 21)
!935 = !DILocation(line: 594, column: 32, scope: !936)
!936 = !DILexicalBlock(scope: !930, file: !703, line: 594, column: 32)
!937 = !DILocation(line: 600, column: 9, scope: !920)
!938 = !DILocalVariable(name: "msg", scope: !920, file: !703, line: 600, type: !112)
!939 = !DILocation(line: 602, column: 27, scope: !920)
!940 = !DILocation(line: 598, column: 60, scope: !941)
!941 = !DILexicalBlock(scope: !934, file: !703, line: 598, column: 29)
!942 = !DILocation(line: 599, column: 20, scope: !943)
!943 = !DILexicalBlock(scope: !934, file: !703, line: 598, column: 60)
!944 = !DILocation(line: 599, column: 20, scope: !945)
!945 = !DILexicalBlock(scope: !943, file: !703, line: 599, column: 20)
!946 = !DILocation(line: 599, column: 20, scope: !947)
!947 = !DILexicalBlock(scope: !945, file: !703, line: 599, column: 20)
!948 = !DILocation(line: 600, column: 9, scope: !943)
!949 = !DILocation(line: 600, column: 9, scope: !950)
!950 = !DILexicalBlock(scope: !943, file: !703, line: 600, column: 9)
!951 = distinct !DISubprogram(name: "abort", linkageName: "ubsan_rt.overflowHandler.S.abort.2", scope: !41, file: !41, line: 153, type: !774, scopeLine: 157, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!952 = !DILocation(line: 157, column: 33, scope: !951)
!953 = !DILocalVariable(name: "data", arg: 1, scope: !951, file: !41, line: 157, type: !777)
!954 = !DILocalVariable(name: "lhs_handle", arg: 2, scope: !951, file: !41, line: 157, type: !782)
!955 = !DILocalVariable(name: "rhs_handle", arg: 3, scope: !951, file: !41, line: 157, type: !782)
!956 = !DILocation(line: 158, column: 20, scope: !951)
!957 = distinct !DISubprogram(name: "handler", linkageName: "ubsan_rt.overflowHandler.S.handler.3", scope: !41, file: !41, line: 161, type: !774, scopeLine: 165, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!958 = !DILocation(line: 165, column: 33, scope: !957)
!959 = !DILocalVariable(name: "data", arg: 1, scope: !957, file: !41, line: 165, type: !777)
!960 = !DILocalVariable(name: "lhs_handle", arg: 2, scope: !957, file: !41, line: 165, type: !782)
!961 = !DILocalVariable(name: "rhs_handle", arg: 3, scope: !957, file: !41, line: 165, type: !782)
!962 = !DILocation(line: 166, column: 13, scope: !957)
!963 = !DILocation(line: 166, column: 67, scope: !957)
!964 = !DILocalVariable(name: "lhs", scope: !957, file: !41, line: 166, type: !791)
!965 = !DILocation(line: 167, column: 13, scope: !957)
!966 = !DILocation(line: 167, column: 67, scope: !957)
!967 = !DILocalVariable(name: "rhs", scope: !957, file: !41, line: 167, type: !791)
!968 = !DILocation(line: 168, column: 40, scope: !969)
!969 = !DILexicalBlock(scope: !957, file: !41, line: 168, column: 36)
!970 = !DILocation(line: 168, column: 52, scope: !969)
!971 = !DILocation(line: 168, column: 52, scope: !957)
!972 = !DILocalVariable(name: "signed_str", scope: !957, file: !41, line: 168, type: !112)
!973 = !DILocation(line: 169, column: 18, scope: !957)
!974 = !DILocation(line: 172, column: 46, scope: !957)
!975 = !DILocation(line: 172, column: 57, scope: !957)
!976 = !DILocation(line: 168, column: 52, scope: !977)
!977 = !DILexicalBlock(scope: !969, file: !41, line: 168, column: 52)
!978 = distinct !DISubprogram(name: "panicExtra__anon_2399", linkageName: "debug.panicExtra__anon_2399", scope: !703, file: !703, line: 584, type: !834, scopeLine: 588, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!979 = !DILocalVariable(name: "ret_addr", arg: 1, scope: !978, file: !703, line: 588, type: !183)
!980 = !DILocation(line: 588, column: 12, scope: !978)
!981 = !DILocalVariable(name: "args", arg: 2, scope: !978, file: !703, line: 588, type: !838)
!982 = !DILocation(line: 592, column: 5, scope: !978)
!983 = !DILocalVariable(name: "trunc_msg", scope: !978, file: !703, line: 592, type: !849)
!984 = !DILocation(line: 593, column: 5, scope: !978)
!985 = !DILocalVariable(name: "buf", scope: !978, file: !703, line: 593, type: !855)
!986 = !DILocation(line: 594, column: 32, scope: !978)
!987 = !DILocation(line: 594, column: 32, scope: !988)
!988 = !DILexicalBlock(scope: !978, file: !703, line: 594, column: 32)
!989 = !DILocation(line: 594, column: 28, scope: !978)
!990 = !DILocalVariable(name: "bw", scope: !978, file: !703, line: 594, type: !863)
!991 = !DILocation(line: 598, column: 29, scope: !992)
!992 = !DILexicalBlock(scope: !978, file: !703, line: 598, column: 21)
!993 = !DILocation(line: 594, column: 32, scope: !994)
!994 = !DILexicalBlock(scope: !988, file: !703, line: 594, column: 32)
!995 = !DILocation(line: 600, column: 9, scope: !978)
!996 = !DILocalVariable(name: "msg", scope: !978, file: !703, line: 600, type: !112)
!997 = !DILocation(line: 602, column: 27, scope: !978)
!998 = !DILocation(line: 598, column: 60, scope: !999)
!999 = !DILexicalBlock(scope: !992, file: !703, line: 598, column: 29)
!1000 = !DILocation(line: 599, column: 20, scope: !1001)
!1001 = !DILexicalBlock(scope: !992, file: !703, line: 598, column: 60)
!1002 = !DILocation(line: 599, column: 20, scope: !1003)
!1003 = !DILexicalBlock(scope: !1001, file: !703, line: 599, column: 20)
!1004 = !DILocation(line: 599, column: 20, scope: !1005)
!1005 = !DILexicalBlock(scope: !1003, file: !703, line: 599, column: 20)
!1006 = !DILocation(line: 600, column: 9, scope: !1001)
!1007 = !DILocation(line: 600, column: 9, scope: !1008)
!1008 = !DILexicalBlock(scope: !1001, file: !703, line: 600, column: 9)
!1009 = distinct !DISubprogram(name: "abort", linkageName: "ubsan_rt.overflowHandler.S.abort.3", scope: !41, file: !41, line: 153, type: !774, scopeLine: 157, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!1010 = !DILocation(line: 157, column: 33, scope: !1009)
!1011 = !DILocalVariable(name: "data", arg: 1, scope: !1009, file: !41, line: 157, type: !777)
!1012 = !DILocalVariable(name: "lhs_handle", arg: 2, scope: !1009, file: !41, line: 157, type: !782)
!1013 = !DILocalVariable(name: "rhs_handle", arg: 3, scope: !1009, file: !41, line: 157, type: !782)
!1014 = !DILocation(line: 158, column: 20, scope: !1009)
!1015 = distinct !DISubprogram(name: "alignmentAssumptionHandler", linkageName: "ubsan_rt.alignmentAssumptionHandler", scope: !41, file: !41, line: 240, type: !1016, scopeLine: 245, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!776, !1018, !782, !782, !782}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*ubsan_rt.AlignmentAssumptionData", baseType: !1019, size: 64, align: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "ubsan_rt.AlignmentAssumptionData", scope: !47, size: 320, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1019, baseType: !69, size: 128, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "assumption_loc", scope: !1019, baseType: !69, size: 128, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !1019, baseType: !86, size: 64, align: 64, offset: 256)
!1024 = !DILocation(line: 245, column: 25, scope: !1015)
!1025 = !DILocalVariable(name: "data", arg: 1, scope: !1015, file: !41, line: 245, type: !1018)
!1026 = !DILocalVariable(name: "pointer", arg: 2, scope: !1015, file: !41, line: 245, type: !782)
!1027 = !DILocalVariable(name: "alignment_handle", arg: 3, scope: !1015, file: !41, line: 245, type: !782)
!1028 = !DILocalVariable(name: "maybe_offset", arg: 4, scope: !1015, file: !41, line: 245, type: !782)
!1029 = !DILocation(line: 246, column: 26, scope: !1015)
!1030 = !DILocation(line: 246, column: 49, scope: !1015)
!1031 = !DILocation(line: 246, column: 47, scope: !1015)
!1032 = !DILocalVariable(name: "real_pointer", scope: !1015, file: !41, line: 246, type: !110)
!1033 = !DILocation(line: 247, column: 5, scope: !1015)
!1034 = !DILocalVariable(name: "lsb", scope: !1015, file: !41, line: 247, type: !1035)
!1035 = !DIBasicType(name: "u7", size: 8, encoding: DW_ATE_unsigned)
!1036 = !DILocation(line: 248, column: 45, scope: !1015)
!1037 = !DILocation(line: 248, column: 42, scope: !1015)
!1038 = !DILocalVariable(name: "actual_alignment", scope: !1015, file: !41, line: 248, type: !5)
!1039 = !DILocation(line: 249, column: 18, scope: !1015)
!1040 = !DILocation(line: 249, column: 48, scope: !1015)
!1041 = !DILocalVariable(name: "mask", scope: !1015, file: !41, line: 249, type: !110)
!1042 = !DILocation(line: 250, column: 5, scope: !1015)
!1043 = !DILocalVariable(name: "misalignment_offset", scope: !1015, file: !41, line: 250, type: !110)
!1044 = !DILocation(line: 251, column: 5, scope: !1015)
!1045 = !DILocation(line: 251, column: 71, scope: !1015)
!1046 = !DILocalVariable(name: "alignment", scope: !1015, file: !41, line: 251, type: !791)
!1047 = !DILocation(line: 253, column: 9, scope: !1015)
!1048 = !DILocation(line: 253, column: 9, scope: !1049)
!1049 = !DILexicalBlock(scope: !1015, file: !41, line: 253, column: 9)
!1050 = !DILocalVariable(name: "offset", scope: !1049, file: !41, line: 253, type: !782)
!1051 = !DILocation(line: 254, column: 14, scope: !1049)
!1052 = !DILocation(line: 260, column: 17, scope: !1049)
!1053 = !DILocation(line: 261, column: 21, scope: !1049)
!1054 = !DILocation(line: 261, column: 32, scope: !1049)
!1055 = !DILocation(line: 267, column: 14, scope: !1056)
!1056 = !DILexicalBlock(scope: !1015, file: !41, line: 254, column: 14)
!1057 = !DILocation(line: 273, column: 21, scope: !1056)
!1058 = !DILocation(line: 273, column: 32, scope: !1056)
!1059 = distinct !DISubprogram(name: "integerOverflow", linkageName: "debug.FullPanic((function 'defaultPanic')).integerOverflow", scope: !703, file: !703, line: 86, type: !1060, scopeLine: 86, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!776, !811}
!1062 = !DILocation(line: 88, column: 17, scope: !1059)
!1063 = distinct !DISubprogram(name: "integerOutOfBounds", linkageName: "debug.FullPanic((function 'defaultPanic')).integerOutOfBounds", scope: !703, file: !703, line: 82, type: !1060, scopeLine: 82, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!1064 = !DILocation(line: 84, column: 17, scope: !1063)
!1065 = distinct !DISubprogram(name: "panicExtra__anon_2504", linkageName: "debug.panicExtra__anon_2504", scope: !703, file: !703, line: 584, type: !1066, scopeLine: 588, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!776, !811, !836, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*struct { ubsan_rt.Value, usize, [:0]const u8, u64, usize }", baseType: !1069, size: 64, align: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct { ubsan_rt.Value, usize, [:0]const u8, u64, usize }", scope: !47, size: 448, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "0", scope: !1069, baseType: !791, size: 128, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "1", scope: !1069, baseType: !110, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "2", scope: !1069, baseType: !112, size: 128, align: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "3", scope: !1069, baseType: !5, size: 64, align: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "4", scope: !1069, baseType: !110, size: 64, align: 64, offset: 384)
!1076 = !DILocalVariable(name: "ret_addr", arg: 1, scope: !1065, file: !703, line: 588, type: !183)
!1077 = !DILocation(line: 588, column: 12, scope: !1065)
!1078 = !DILocalVariable(name: "args", arg: 2, scope: !1065, file: !703, line: 588, type: !1069)
!1079 = !DILocation(line: 592, column: 5, scope: !1065)
!1080 = !DILocalVariable(name: "trunc_msg", scope: !1065, file: !703, line: 592, type: !849)
!1081 = !DILocation(line: 593, column: 5, scope: !1065)
!1082 = !DILocalVariable(name: "buf", scope: !1065, file: !703, line: 593, type: !855)
!1083 = !DILocation(line: 594, column: 32, scope: !1065)
!1084 = !DILocation(line: 594, column: 32, scope: !1085)
!1085 = !DILexicalBlock(scope: !1065, file: !703, line: 594, column: 32)
!1086 = !DILocation(line: 594, column: 28, scope: !1065)
!1087 = !DILocalVariable(name: "bw", scope: !1065, file: !703, line: 594, type: !863)
!1088 = !DILocation(line: 598, column: 29, scope: !1089)
!1089 = !DILexicalBlock(scope: !1065, file: !703, line: 598, column: 21)
!1090 = !DILocation(line: 594, column: 32, scope: !1091)
!1091 = !DILexicalBlock(scope: !1085, file: !703, line: 594, column: 32)
!1092 = !DILocation(line: 600, column: 9, scope: !1065)
!1093 = !DILocalVariable(name: "msg", scope: !1065, file: !703, line: 600, type: !112)
!1094 = !DILocation(line: 602, column: 27, scope: !1065)
!1095 = !DILocation(line: 598, column: 60, scope: !1096)
!1096 = !DILexicalBlock(scope: !1089, file: !703, line: 598, column: 29)
!1097 = !DILocation(line: 599, column: 20, scope: !1098)
!1098 = !DILexicalBlock(scope: !1089, file: !703, line: 598, column: 60)
!1099 = !DILocation(line: 599, column: 20, scope: !1100)
!1100 = !DILexicalBlock(scope: !1098, file: !703, line: 599, column: 20)
!1101 = !DILocation(line: 599, column: 20, scope: !1102)
!1102 = !DILexicalBlock(scope: !1100, file: !703, line: 599, column: 20)
!1103 = !DILocation(line: 600, column: 9, scope: !1098)
!1104 = !DILocation(line: 600, column: 9, scope: !1105)
!1105 = !DILexicalBlock(scope: !1098, file: !703, line: 600, column: 9)
!1106 = distinct !DISubprogram(name: "panicExtra__anon_2522", linkageName: "debug.panicExtra__anon_2522", scope: !703, file: !703, line: 584, type: !1107, scopeLine: 588, flags: DIFlagStaticMember | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!776, !811, !836, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*struct { ubsan_rt.Value, [:0]const u8, u64, usize }", baseType: !1110, size: 64, align: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct { ubsan_rt.Value, [:0]const u8, u64, usize }", scope: !47, size: 384, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "0", scope: !1110, baseType: !791, size: 128, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "1", scope: !1110, baseType: !112, size: 128, align: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "2", scope: !1110, baseType: !5, size: 64, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "3", scope: !1110, baseType: !110, size: 64, align: 64, offset: 320)
!1116 = !DILocalVariable(name: "ret_addr", arg: 1, scope: !1106, file: !703, line: 588, type: !183)
!1117 = !DILocation(line: 588, column: 12, scope: !1106)
!1118 = !DILocalVariable(name: "args", arg: 2, scope: !1106, file: !703, line: 588, type: !1110)
!1119 = !DILocation(line: 592, column: 5, scope: !1106)
